/**********************************
函数功能:按位实现加法运算
参数1:加数
参数2:被加数
返回值:两数和
说明:按位，递归实现
头文件:无
作者: Lee.C
完成时间:2016-07-17
**************************************/
int Add1(int num1, int num2)
{
	int sum = 0, carry = 0;

	//没有进位时完成运算
	if(num2 == 0)
		return num1;

	//没有进位的加法运算
	sum = num1 ^ num2;
	//进位并且左移
	carry = (num1 & num2) << 1;

	return Add(sum, carry);
}

/**********************************
函数功能:按位实现加法运算
参数1:加数
参数2:被加数
返回值:两数和
说明:按位，迭代实现
头文件:无
作者: Lee.C
完成时间:2016-08-20
**************************************/
int Add2(int num1, int num2)
{
	 int sum = 0, carry = 0;

	 //第一次把两数做不进位加法，
	 //获取到不进位和和各个进位
	 //之后不断的把无进位的和与
	 //进位做相同运算，得到进位和
	 do
	 {
		 sum = num1 ^ num2;
		 carry = (num1 & num2) << 1;

		 num1 = sum;
		 num2 = carry;
	 }while(num2 != 0);

	 return num1;
}